import sys; sys.stdin = open('txt/append_paper.txt')
# 20 x N 크기의 종이를 만드는 방법의 개수를 구하기
"""
    20 * n = N+1
    N = 30?
    10 10 10, 10 20
    1개    +   (10 20            / 20 10 
                / 10 (10,10) / (10,10) 10 ) 4개 => 5개
    1     + 2 * 2
    1 + (n//10 -1) * 2**(n//10-2) + 
    n = 40
    10 10 10 10 / 10 10 20 / 20 20
    1 +             3*2     2*2  => 11 
    n = 50
    10 10 10 10 10, 10 10 10 20. 10 20 20
    1      +        ( 10 10 10 20 / 10 10 10 (10,10)
    1 + 4*2                                     +3*2*2 == 21
        순서(4) * 20일때/(10,10) 일때 총 2개씩      순서(3) * 20/(10,10) 2개씩 2번
    1 + (n//10 -1) * 2**(n//10-2) 적용될까? 아니다
    1 + (n//10 -1) * 2**(n//10-4) + (n//10 -2) * 2**(n//10 -3) 
    for i in range(1,n+1): # n = N//10
        # i = 1 ~ i =5
        (n - i) * 2**i 
        + (n -(i+1)) * 2**(i+1)  
        이 방법은 글렀다.
        
     N: 10 => 1개
     N: 20 => 3개 
     N: 30 => 5개 3*2 -1? (o) 3 + 1 + 1 (o)
     N: 40 => 11개 5*2 -3? (x)  5 + 3 + 3 (o)
     N: 50 => 21개 11+ 5 + 5 (o)
     f(n-1) + 2* f(n-2) 
    """
T = int(input())
def paper(n):
    if n == 1:
        return 1
    elif n == 2:
        return 3
    else:
        return paper(n-1) + 2 *paper(n-2)
for tc in range(1, T + 1):
    N = int(input()) // 10
    print(f'#{tc} {paper(N)}')
