hexa = [
    [0,0,0,0], # 0
    [0,0,0,1], # 1
    [0,0,1,0], # 2
    [0,0,1,1], # 3
    [0,1,0,0], # 4
    [0,1,0,1], # 5
    [0,1,1,0], # 6
    [0,1,1,1], # 7
    [1,0,0,0], # 8
    [1,0,0,1], # 9
    [1,0,1,0], # 10(A)
    [1,0,1,1], # 11(B)
    [1,1,0,0], # 12(C)
    [1,1,0,1], # 13(D)
    [1,1,1,0], # 14(E)
    [1,1,1,1], # 15(F)
]
def a2d(c): # c : character
    if c <= '9':
        return ord(c) - ord('0')
    else:
        return ord(c) - ord('A') + 10 # A가 들어왔을때 10을만든다 생각하면 됨

def d2b(x):
    for i in range(4):
        ans.append(hexa[x][i])
str1 = 'F9' # 16진수 -> 10진수 -> 2진수
ans = []
for i in range(len(str1)):
    d2b(a2d(str1[i]))
# d2b()
print(ans)